src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ea24046-be85-4b3a-a7fb-94daa9d5fd13">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5e6796ec-3e70-4c2b-bfd3-734561cf90ee">
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f821e82b-1396-4cc3-b7e8-c44de00ea420">
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="38ae23fc-25c4-4c92-adaa-c82453712b32">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6b6b5a9-764c-4b57-9769-042ea6bf7581">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a91451d2-f8b3-4ea7-83e6-c95f5ae8d662">
    <name>ПодразделениеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="726ebb84-7974-4d9f-a2e6-33fbab82380d">
    <name>РучнаяКорректировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73b5e625-ebb5-4178-8cc0-960843f75cea">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b6076129-af23-479c-86e9-e591eb40a244">
    <name>СпособЗачетаАвансов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="006e1000-e354-4c40-88f7-fdcb1897326b">
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aeb99934-f54a-4896-bffb-39f0a61b015c">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cb1302b9-3f01-48b0-8149-955656f1f5b1">
    <name>ТипЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0faa80a2-8a4b-4882-88bf-f343e422ab71">
      <name>ДоговорКонтрагента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="396743c0-9652-4280-b8f2-b4c77cbed751">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5775cf55-4a2c-40bd-bfbc-567d71330811">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1a445c0b-4467-4e89-af38-298cab058550">
    <name>АгентскиеУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ff4e80f3-34f0-4240-bdea-aa0631fc0539">
      <name>ДоговорКонтрагента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Базар_СтатусыНаличияБумажногоДокумента/Базар_СтатусыНаличияБумажногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Базар_СтатусыНаличияБумажногоДокумента</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусБумажногоДокумента</name>
    <type>
      <types>EnumRef.Базар_СтатусыНаличияБумажногоДокумента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Базар_СтатусыНаличияБумажногоДокумента/Базар_СтатусыНаличияБумажногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Базар_СтатусыНаличияБумажногоДокумента</name>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>ПолученСОшибками</name>
  </enumValues>
  <enumValues>
    <name>ПолученКорректным</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПоступлениеТоваровУслуг/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции

&НаСервереБезКонтекста
Процедура СменитьСтатусБумажногоДокументаНаСервере(Документ, СтатусБумажногоДокумента)
	
	НаборЗаписей = РегистрыСведений.Базар_СтатусыНаличияБумажногоДокумента.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Документ);
	НаборЗаписей.Очистить();
	
	НоваяЗапись                          = НаборЗаписей.Добавить();
	НоваяЗапись.Объект                   = Документ;
	НоваяЗапись.СтатусБумажногоДокумента = СтатусБумажногоДокумента;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусБумажногоДокумента(Команда)
	СсылкаНаДокумент = ПолучитьЗначениеРеквизита(Элементы.Список.ВыделенныеСтроки[0], "Ссылка");
	
	Если Команда.Имя = "СменитьСтатусБумажногоДокумента_Отсутствует" тогда
		СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.Отсутствует");
	ИначеЕсли Команда.Имя = "СменитьСтатусБумажногоДокумента_СОшибками" тогда
		СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.ПолученСОшибками");
	ИначеЕсли Команда.Имя = "СменитьСтатусБумажногоДокумента_Корректный" тогда
		СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.ПолученКорректным");
	КонецЕсли;
	
	Для Счетчик = 1 по Элементы.Список.ВыделенныеСтроки.Количество() цикл
		СтрокаСписка = Элементы.Список.ВыделенныеСтроки.Получить(Счетчик - 1);
		СсылкаНаОбъект = ПолучитьЗначениеРеквизита(СтрокаСписка, "Ссылка");
		Если ПолучитьЗначениеРеквизита(СсылкаНаОбъект, "Проведен") тогда
			Если УстановитьПометкиСтатусаБумажногоДокумента(СтатусБумажногоДокумента) тогда
				СменитьСтатусБумажногоДокументаНаСервере(СсылкаНаОбъект, СтатусБумажногоДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Функция УстановитьПометкиСтатусаБумажногоДокумента(СтатусБумажногоДокумента = Неопределено)
	
	ДоступностьЭлементовУправления = Истина;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(СтатусБумажногоДокумента) тогда
			СтатусБумажногоДокумента = Элементы.Список.ТекущиеДанные.СтатусБумажногоДокумента;
		КонецЕсли;
		
		Если НЕ ПолучитьЗначениеРеквизита(Элементы.Список.ВыделенныеСтроки[0], "Проведен") тогда
			ДоступностьЭлементовУправления = Ложь;
		КонецЕсли;
		
		Если СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.Отсутствует") тогда
			Элементы.Отсутствует.Пометка = Истина;
			Элементы.Отсутствует1.Пометка = Истина;
		Иначе
			Элементы.Отсутствует.Пометка = Ложь;
			Элементы.Отсутствует1.Пометка = Ложь;
		КонецЕсли;
		
		Если СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.ПолученСОшибками") тогда
			Элементы.СОшибками.Пометка = Истина;
			Элементы.СОшибками1.Пометка = Истина;
		Иначе
			Элементы.СОшибками.Пометка = Ложь;
			Элементы.СОшибками1.Пометка = Ложь;
		КонецЕсли;
		
		Если СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.ПолученКорректным") тогда
			Элементы.Корректный.Пометка = Истина;
			Элементы.Корректный1.Пометка = Истина;
		Иначе
			Элементы.Корректный.Пометка = Ложь;
			Элементы.Корректный1.Пометка = Ложь;
		КонецЕсли;
		
	Исключение
		ДоступностьЭлементовУправления = Ложь;
	КонецПопытки;
	
	Если Элементы.Отсутствует.Доступность <> ДоступностьЭлементовУправления тогда
		Элементы.Отсутствует.Доступность  = ДоступностьЭлементовУправления;
		Элементы.Отсутствует1.Доступность = ДоступностьЭлементовУправления;
		Элементы.СОшибками.Доступность    = ДоступностьЭлементовУправления;
		Элементы.СОшибками1.Доступность   = ДоступностьЭлементовУправления;
		Элементы.Корректный.Доступность   = ДоступностьЭлементовУправления;
		Элементы.Корректный1.Доступность  = ДоступностьЭлементовУправления;
	КонецЕсли;
	
	Возврат ДоступностьЭлементовУправления;
КонецФункции

&НаКлиенте
Процедура Базар_СписокПриАктивизацииСтрокиПосле(Элемент)
	
	УстановитьПометкиСтатусаБумажногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_СписокПриИзмененииПосле(Элемент)
	
	УстановитьПометкиСтатусаБумажногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_ПриОткрытииПосле(Отказ)
	
	ОтображатьСтатусыДокументов = Ложь;
	Элементы.ИзменитьСтатус.Видимость = Ложь;
	Элементы.ПодменюСтатус.Видимость = Ложь;
	Элементы.СписокКонтекстноеМенюПодменюСтатус.Видимость = Ложь;
	
КонецПроцедуры
